# GetActivePredefinedSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPDFSettings..::..GetActivePredefinedSettings Method
ExportPDFSettings Class See Also
---
Gets the active settings element in the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ExportPDFSettings GetActivePredefinedSettings(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetActivePredefinedSettings ( _
	document As Document _
) As ExportPDFSettings
```

Visual C++
---
```text
public:
static ExportPDFSettings^ GetActivePredefinedSettings(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document to find the active settings.
# ### Return Value
The active settings, or nullNothingnullptra null reference (Nothing in Visual Basic) if none.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportPDFSettings Class
Autodesk.Revit.DB Namespace